# -*- coding: UTF-8 -*-

# Persian class
module Persian
  class Text
    AR_FA_CHAR = {
      'ك' => 'ک',
      'دِ' => 'د',
      'بِ' => 'ب',
      'زِ' => 'ز',
      'ذِ' => 'ذ',
      'شِ' => 'ش',
      'سِ' => 'س',
      'ى' => 'ی',
      'ي' => 'ی',
      'ة' => 'ه',
      'هٔ' => 'ه'
    }.freeze

    HAREKATS = [
      'َ', # Ae
      'ِ', # E
      'ُ', # O
      'ً', # An
      'ٍ', # En
      'ٌ', # On
      'ْ', # Saken
      'ّ' # Tashdid
    ].freeze

    END_VOWEL = [
      'ه',
      'ا',
      'و'
    ].freeze

    # Exchange Standard QWERTY Keyboard layout
    EN_FA_KEYBOARD_CHAR = {
      # Lowercase Letters
      'q' => 'ض',
      'w' => 'ص',
      'e' => 'ث',
      'r' => 'ق',
      't' => 'ف',
      'y' => 'غ',
      'u' => 'ع',
      'i' => 'ه',
      'o' => 'خ',
      'p' => 'ح',
      '[' => 'ج',
      ']' => 'چ',
      '\\' => '\\',
      'a' => 'ش',
      's' => 'س',
      'd' => 'ی',
      'f' => 'ب',
      'g' => 'ل',
      'h' => 'ا',
      'j' => 'ت',
      'k' => 'ن',
      'l' => 'م',
      ';' => 'ک',
      '\'' => 'گ',
      'z' => 'ظ',
      'x' => 'ط',
      'c' => 'ز',
      'v' => 'ر',
      'b' => 'ذ',
      'n' => 'د',
      'm' => 'پ',
      ',' => 'و',
      '.' => '.',
      '/' => '/',
      # Uppercase Letters
      'Q' => 'ْ',
      'W' => 'ٌ',
      'E' => 'ٍ',
      'R' => 'ً',
      'T' => 'ُ',
      'Y' => 'ِ',
      'U' => 'َ',
      'I' => 'ّ',
      'O' => ']',
      'P' => '[',
      '{' => '}',
      '}' => '{',
      '|' => '|',
      'A' => 'ؤ',
      'S' => 'ئ',
      'D' => 'ي',
      'F' => 'إ',
      'G' => 'أ',
      'H' => 'آ',
      'J' => 'ة',
      'K' => '»',
      'L' => '«',
      ':' => ':',
      '"' => '؛',
      'Z' => 'ك',
      'X' => 'ٓ',
      'C' => 'ژ',
      'V' => 'ٰ',
      'B' => '‌',
      'N' => 'ٔ',
      'M' => 'ء',
      '<' => '>',
      '>' => '<',
      '?' => '؟',
      # Numbers without shift key
      '`' => '‍',
      '1' => '۱',
      '2' => '۲',
      '3' => '۳',
      '4' => '۴',
      '5' => '۵',
      '6' => '۶',
      '7' => '۷',
      '8' => '۸',
      '9' => '۹',
      '0' => '۰',
      '-' => '-',
      '=' => '=',
      # Numbers With Shift key
      '~' => '÷',
      '!' => '!',
      '@' => '٬',
      '#' => '٫',
      '$' => '﷼',
      '%' => '٪',
      '^' => '×',
      '&' => '،',
      '*' => '*',
      '(' => ')',
      ')' => '(',
      '_' => 'ـ',
      '+' => '+'
    }.freeze
  end
end
